Revit 2027 API
UnitTypeId.CurrencyPerSquareMeter Property
 Cost per square meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurrencyPerSquareMeter { get; }
Public Shared ReadOnly Property CurrencyPerSquareMeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurrencyPerSquareMeter {
	ForgeTypeId^ get ();
}
static member CurrencyPerSquareMeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace